> ***Python Project (Group 6)***  

By:  
- Papa Kofi Arhin  
- Timothy Amissah  
- Joshua Kwaku Lary  
- Eddie Morgan

***Database Import into SQL using SQLite3 package***

In [1]:
#importing libraries:

import sqlite3
import csv
import pandas as pd

In [2]:
conn = sqlite3.connect('Finance_Companies.db') #creating a database in SQL called 'Group_6.db'
cursor = conn.cursor() #establishing a connection between Python and SQL

In [3]:
#create table in SQL:
create_table = """CREATE TABLE Company_Details(                
                        CLCODE INT PRIMARY KEY,
                        NAME VARCHAR(255),
                        STNAME TEXT,
                        ACTIVE VARCHAR(1),
                        ESTYMD DATE,
                        NETINC REAL,
                        ASSET REAL,
                        EQ REAL,
                        REPDTE DATE);
                """

#fname means 'first name'. lname means 'last name'.
cursor.execute(create_table) #this needs to be done to save/store the table into your database.

OperationalError: table Company_Details already exists

In [4]:
with open("Financial_Institutions.csv") as f:
    data = csv.reader(f)
    for row in data:
        for row in data:
            if row[0] == 'CLCODE':  # Skip the header row
                continue

            cursor.execute(
                "INSERT OR IGNORE INTO Company_Details VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)", 
                (row[0], row[1], row[2], row[3], row[4], row[5], row[6], row[7], row[8]))

In [5]:
#show the rows of data in a list:

rows = cursor.execute("SELECT * FROM Company_Details LIMIT 3").fetchall()
rows

[(3,
  'First National Bank of Millstadt',
  'Illinois',
  '0',
  '11/3/1906',
  -770.0,
  86287.0,
  10088.0,
  '9/30/2007'),
 (21,
  'Territory Bank',
  'Oklahoma',
  '0',
  '1/1/1902',
  -19.0,
  13984.0,
  1282.0,
  '9/30/2006'),
 (13,
  'The First Bank of Haskell',
  'Oklahoma',
  '0',
  '7/31/1905',
  427.0,
  25991.0,
  2239.0,
  '12/31/2006')]

In [6]:
#Calculate Return on Assets (ROA) and add as a new column to the existing table:

cursor.execute("ALTER TABLE Company_Details ADD COLUMN ROA REAL")

cursor.execute("""UPDATE Company_Details SET ROA = (NETINC * 100) /ASSET WHERE ASSET > 0""")

In [7]:
#Calculate Return on Equity (ROE) and add as a new column to the existing table:

cursor.execute("ALTER TABLE Company_Details ADD COLUMN ROE REAL")

cursor.execute("""UPDATE Company_Details SET ROE = (NETINC * 100)/EQ WHERE EQ > 0""")

In [8]:
#read SQL query as a data frame in Python:

Data = pd.read_sql_query("SELECT * FROM Company_Details", conn)
Data.head(10)

,CLCODE,NAME,STNAME,ACTIVE,ESTYMD,NETINC,ASSET,EQ,REPDTE,ROA,ROE
0,3,First National Bank of Millstadt,Illinois,0,11/3/1906,-770.0,86287.0,10088.0,9/30/2007,-0.892371,-7.632831
1,21,Territory Bank,Oklahoma,0,1/1/1902,-19.0,13984.0,1282.0,9/30/2006,-0.135870,-1.482059
2,13,The First Bank of Haskell,Oklahoma,0,7/31/1905,427.0,25991.0,2239.0,12/31/2006,1.642876,19.071014
3,50,"The First National Bank and Trust, Wibaux, Mon...",Montana,0,6/16/1906,39.0,1602.0,1602.0,9/30/1997,2.434457,2.434457
4,33,Chittenden Trust Company,Vermont,0,11/5/1906,41463.0,3793058.0,613282.0,12/31/2008,1.093129,6.760838
5,42,Farmers & Mechanics Savings Bank of Minneapolis,Minnesota,0,01/01/1874,,,,,NaN,NaN
6,43,Trenton Savings Bank FSB,New Jersey,0,01/01/1844,4053.0,1372557.0,241267.0,3/31/1999,0.295288,1.679882
7,41,Germantown Savings Bank,Pennsylvania,0,04/06/1854,16778.0,1564697.0,156096.0,9/30/1994,1.072284,10.748514
8,44,"The Lincoln Savings Bank, FSB",New York,0,06/30/1866,-3061.0,2093569.0,121703.0,6/30/1994,-0.146210,-2.515139
9,23,Mill Creek Bank,Utah,0,11/17/1997,10162.0,2664982.0,333526.0,3/31/2003,0.381316,3.046839

In [9]:
#Save and close the database

conn.commit()
# conn.close()